/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Ekstensi Telesec";
"06 06 02 82 06 01 0A 01"		= "Mekanisme Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Pengesahan Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Pengesahan Kata Sandi";
"06 08 02 82 06 01 0A 01 00 02" = "Pengesahan Kata Sandi Terlindungi ";
"06 08 02 82 06 01 0A 01 00 03" = "Pengesahan Satu-Arah X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Pengesahan Dua-Arah X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Pengesahan Tiga-Arah X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Pengesahan Satu-Arah ISO9798 ";
"06 08 02 82 06 01 0A 01 00 07" = "Pengesahan Dua-Arah  ISO9798 ";
"06 08 02 82 06 01 0A 01 00 08" = "Pengesahan Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Tanda Tangan Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 dengan RSA dan ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 dengan Tanda Tangan Standar RSA dan Telesec ";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 dengan RSA dan ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 dengan Tanda Tangan Standar RSA dan Telesec ";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 dengan Tanda Tangan Standar RSA dan Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Tanda Tangan HBCI RSA ";

"06 07 02 82 06 01 0A 01 02"	= "Enkripsi Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "tidak ada";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Fungsi Satu-Arah";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Bagian menggunakan Cipher Blok";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Fungsi FEC ";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Modul Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritma";
"06 07 02 82 06 01 0A 02 01"	= "Jenis Atribut";
"06 07 02 82 06 01 0A 02 02"	= "Jenis Sertifikat";
"06 07 02 82 06 01 0A 02 03"	= "Jenis Pesan";
"06 07 02 82 06 01 0A 02 04"	= "Protokol PL ";
"06 07 02 82 06 01 0A 02 05"	= "SME dan Komponen SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definisi Berguna";
"06 07 02 82 06 01 0A 02 08"	= "File STE ";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Order Elektronik";
"06 07 02 82 06 01 0A 02 0B"	= "Aplikasi Asimetrik Telesec TTP ";
"06 07 02 82 06 01 0A 02 0C"	= "Aplikasi Basis Telesec TTP ";
"06 07 02 82 06 01 0A 02 0D"	= "Pesan Telesec TTP ";
"06 07 02 82 06 01 0A 02 0E"	= "Aplikasi Tanda Waktu Telesec TTP ";

"06 06 02 82 06 01 0A 03"		= "Kelas Objek";
"06 07 02 82 06 01 0A 03 00"	= "Nama Lain Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Direktori";
"06 07 02 82 06 01 0A 03 02"	= "Jenis Direktori ";
"06 07 02 82 06 01 0A 03 03"	= "Grup Direktori ";
"06 07 02 82 06 01 0A 03 04"	= "Direktori Pengguna";
"06 07 02 82 06 01 0A 03 05"	= "Kunci Masuk Simetrik";

"06 06 02 82 06 01 0A 04"		= "Paket";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Nama Ikatan";
"06 06 02 82 06 01 0A 07"		= "Atribut";
"06 07 02 82 06 01 0A 07 00"	= "Pengenal Grup Aplikasi";
"06 07 02 82 06 01 0A 07 01"	= "Jenis Sertifikat";
"06 07 02 82 06 01 0A 07 02"	= "Sertifikat Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Nomor Sertifikat";
"06 07 02 82 06 01 0A 07 04"	= "Daftar Pembatalan Sertifikat";
"06 07 02 82 06 01 0A 07 05"	= "Tanggal Pembuatan";
"06 07 02 82 06 01 0A 07 06"	= "Pembuat";
"06 07 02 82 06 01 0A 07 07"	= "Otoritas Pemberian Nama";
"06 07 02 82 06 01 0A 07 08"	= "Direktori Kunci Publik ";
"06 07 02 82 06 01 0A 07 09"	= "Domain Keamanan";
"06 07 02 82 06 01 0A 07 0A"	= "Subjek";
"06 07 02 82 06 01 0A 07 0B"	= "Waktu Pembatalan";
"06 07 02 82 06 01 0A 07 0C"	= "Referensi Grup Pengguna";
"06 07 02 82 06 01 0A 07 0D"	= "Validitas";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Lingkungan Pesan Keamanan";
"06 07 02 82 06 01 0A 07 10"	= "Direktori Kunci Publik Anonim";
"06 07 02 82 06 01 0A 07 11"	= "Nama Awal Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Tambahan Nama";
"06 07 02 82 06 01 0A 07 13"	= "Kode Pos Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Nama Pembeda";
"06 07 02 82 06 01 0A 07 15"	= "Daftar Sertifikat Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Daftar Sertifikat Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Daftar Sertifikat X.509";
"06 07 02 82 06 01 0A 07 18"	= "Waktu Buat";
"06 07 02 82 06 01 0A 07 19"	= "Nomor Fisik Kartu ";
"06 07 02 82 06 01 0A 07 1A"	= "Jenis File";
"06 07 02 82 06 01 0A 07 1B"	= "File Ctl adalah Arsip";
"06 07 02 82 06 01 0A 07 1C"	= "Alamat Email";
"06 07 02 82 06 01 0A 07 1D"	= "Daftar Templat Sertifikat";
"06 07 02 82 06 01 0A 07 1E"	= "Nama Direktori ";
"06 07 02 82 06 01 0A 07 1F"	= "Nama Jenis Direktori ";
"06 07 02 82 06 01 0A 07 20"	= "Nama Grup Direktori ";
"06 07 02 82 06 01 0A 07 21"	= "Direktori Nama Pengguna";
"06 07 02 82 06 01 0A 07 22"	= "Bendera Pembatalan";
"06 07 02 82 06 01 0A 07 23"	= "Nama Kunci Masuk Simetrik";
"06 07 02 82 06 01 0A 07 24"	= "Nomor GL";
"06 07 02 82 06 01 0A 07 25"	= "Nomor GO";
"06 07 02 82 06 01 0A 07 26"	= "Data Kunci G";
"06 07 02 82 06 01 0A 07 27"	= "Data Kunci Z";
"06 07 02 82 06 01 0A 07 28"	= "KT Data Kunci";
"06 07 02 82 06 01 0A 07 2A"	= "Nomor Kunci KT";
"06 07 02 82 06 01 0A 07 33"	= "Waktu Pembuatan Pembatalan";
"06 07 02 82 06 01 0A 07 34"	= "Tes Kewajiban";

"06 06 02 82 06 01 0A 08"		= "Grup Atribut";
"06 06 02 82 06 01 0A 09"		= "Tindakan";
"06 06 02 82 06 01 0A 0A"		= "Pemberitahuan";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplikasi Aman";

"06 06 02 82 06 01 0A 0C"		= "Definisi Sertifikat dan Ekstensi CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Ekstensi Pembatasan Tanggung Jawab Sertifikat Ekstensi";
"06 07 02 82 06 01 0A 0C 01"	= "Ekstensi ID Sertifikat Telesec ";
"06 07 02 82 06 01 0A 0C 02"	= "Pengenal Kebijakan Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID Prasyarat Kebijakan Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Ekstensi Terfilter CRL Telesec ";
"06 07 02 82 06 01 0A 0C 05"	= "Ekstensi Filter CRL Telesec ";
"06 07 02 82 06 01 0A 0C 06"	= "Ekstensi Otoritas Penamaan Telesec ";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID Pengguna";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Kotak Surat RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Komponen Domain ";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Nomor Bisnis Australia";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Pengenal Kebijakan Sertifikat Australia ";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Pribadi";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Stempel Bisnis";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Stempel Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Stempel Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Stempel IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Stempel Pengenal Kebijakan ";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritma Enkripsi Simetrik";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Pengenal Kebijakan SEIS Asuransi-Tinggi";
"06 06 2A 85 70 22 01 02"	= "Pengenal Kebijakan SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Pengenal Pribadi SEIS AT ";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Modul ANSI X9.57 ";
"06 07 2A 86 48 CE 38 01 01"	= "Manajemen Sertifikat X9F1 ";
"06 06 2A 86 48 CE 38 02"		= "Tunda Perintah";
"06 07 2A 86 48 CE 38 02 01"	= "Tanpa Tunda Perintah";
"06 07 2A 86 48 CE 38 02 02"	= "Pembuat Panggilan";
"06 07 2A 86 48 CE 38 02 03"	= "Tolak";
"06 07 2A 86 48 CE 38 02 04"	= "Token Ambil";
"06 06 2A 86 48 CE 38 03"		= "Atribut";
"06 06 2A 86 48 CE 38 03 01"	= "Countersignature";
"06 06 2A 86 48 CE 38 03 02"	= "Sertifikat Atribut";
"06 06 2A 86 48 CE 38 04"		= "Algoritma";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Cocok";
"06 07 2A 86 48 CE 38 04 03"	= "DSA dengan SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Jenis Bidang ANSI X9.62 ";
"06 07 2A 86 48 CE 3D 01 01"	= "Bidang Utama";
"06 07 2A 86 48 CE 3D 01 02"	= "Karakteristik-Dua Kotak";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Karakteristik-Dua Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Basis Trinomial ";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Basis Pentanomial ";
"06 06 2A 86 48 CE 3D 02"		= "Jenis Kunci Publik";
"06 07 2A 86 48 CE 3D 02 01"	= "Kunci Publik Kurva Eliptik";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Jenis Bidang ANSI X9.42 ";
"06 07 2A 86 48 CE 3E 01 01"	= "Bidang Utama Galois ";
"06 06 2A 86 48 CE 3E 02"		= "Jenis Nomor ";
"06 07 2A 86 48 CE 3E 02 01"	= "Kunci Publik Diffie-Hellman ";
"06 06 2A 86 48 CE 3E 03"		= "Skema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Statik";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Mempercayakan Info Versi";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE dengan MD5 dan CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC Berbasis-Kata-Sandi";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Mempercayakan Pengguna";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Mempercayakan Info CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Sertifikat Atribut";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Enkripsi RSA ";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 dengan Enkripsi RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 dengan Enkripsi RSA ";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 dengan Enkripsi RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 dengan Enkripsi RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Enkripsi RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Enkripsi RSA-OAEP ";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP Label Terspesikasi";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Skema Tanda Tangan RSA-PSS ";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 dengan Enkripsi RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 dengan Enkripsi RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 dengan Enkripsi RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 dengan Enkripsi RSA Encryption";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Enkripsi BSAFE RSA ";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Persetujuan Kunci Diffie-Hellman ";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE dengan MD2 dan DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE dengan MD5 dan DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE dengan MD2 dan RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE dengan MD5 dan RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE dengan MD5 dan XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE dengan SHA dan DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Data";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Data Yang Ditandatangani";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Data Tertutup";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Data Tertutup dan Ditandatangani";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Data Diterima";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Data Encrypted ";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data dengan Atribut";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Info Kunci Pribadi Terenkripsi";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Alamat Email";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nama Tidak Berstruktur";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Jenis Konten";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Pesan Terima";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Waktu Tanda Tangan";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Countersignature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Tantang Kata Sandi";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Alamat Tidak Berstruktur";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atribut Sertifikat Yang Diperpanjang";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Nomor Seri dan Pembuat";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Cek Kata Sandi";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Kunci Publik";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Deskripsi Penandatanganan";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Permintaan Ekstensi";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Kemampuan S/MIME ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Pilih Data Yang Ditandatangani";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Tidak Dapat Decrypt Apapun";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Permintaan Laporan";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Laporan";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Petunjuk Konten";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Riwayat Perluasan Daftar Mail";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Modul S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaksis Pesan Kriptografi";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Layanan Keamanan Lanjutan";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME Object Identifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Pesan S/MIME V3 ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Tanda Tangan Elektronik ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Tanda Tangan Elektronik ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Kebijakan Tanda Tangan Elektronik ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Kebijakan Tanda Tangan Elektronik ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Jenis Konten S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Atribut Pengesahan S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritma S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwith3DESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribusi Sertifikat S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribusi Sertifikat LDAP ";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Prasyarat Kebijakan Tanda Tangan S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-url";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Pengenal Jenis Tanda Tangan S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Tanda Tangan Pemulai";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Tanda Tangan Domain ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Tanda Tangan Atribut Tambahan";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Tinjau Tanda Tangan";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Kemampuan S/MIME ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Pilih Biner Di Dalam";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nama Bersahabat (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID Kunci Lokal (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Jenis Sertifikat (untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Sertifikat X.509 (untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Sertifikat SDSI (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Jenis CRL (untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (untuk PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Sintaksis Pertukaran Informasi Pribadi PKCS-12 ";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID Enkripsi Berbasis-Kata-Sandi PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE dengan SHA-1 dan 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE dengan SHA-1 dan 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE dengan SHA-1 dan 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE dengan SHA-1 dan 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE dengan SHA-1 dan 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE dengan SHA-1 dan 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Selubung Kunci PKCS-12 PKCS-8 ";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 Key Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Sertifikat PKCS-12 dan CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID Kantong Rahasia PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID Konten Aman PKCS-12 ";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID Kantong Kunci Terselubung PKCS-12 PKCS-8 ";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Sertifikat PKCS-12 Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Sertifikat PKCS-12 X.509 dan CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Sertifikat PKCS-12 SDSI  Bag ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID Enkripsi Berbasis-Kata-Sandi PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE dengan SHA-1 dan 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE dengan SHA-1 dan 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE dengan SHA-1 dan Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE dengan SHA-1 dan 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE dengan SHA-1 dan 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE dengan SHA-1 dan RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE dengan SHA-1 dan RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID Pembungkus PKCS-12 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA Enkripsi dengan 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA Enkripsi dengan 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA Enkripsi dengan Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 Tanda Tangan ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Tanda Tangan PKCS-12 RSA dengan SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Versi 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Kantong Kunci Terselubung PKCS-12 PKCS-8 ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Sertifikat PKCS-12 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Kantong Rahasia PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Kantong Konten Aman PKCS-12 ";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Modul PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atribut PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Jenis Konten PKCS-15 ";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Konten PKCS-15 ";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritma Digest RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC dengan SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritma Enkripsi RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 dengan MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC ";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Pengenal kebijakan tidak dikenal Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Kelas objek Microsoft Exchange Server ";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Alamat-Situs";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Skema Kelas";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Skema Atribut";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agen-Kotak Surat";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Kotak Surat";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Wadah";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Penerima Mail ";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mekanisme Pengiriman";

"06 07 2A 86 48 86 F7 14 04"				= "Format file Microsoft  ";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Konteks Data Tidak Langsung SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Info Agen SPC ";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Jenis Pernyataan SPC ";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Info SPC Opus ";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Ekstensi Sertifikat SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Data Gambar SPC PE ";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC Link (tipe 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Tanda Tangan Kode Individual ";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Tanda Tangan Kode Komersial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC Link (tipe 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Kriteria Minimal SPC ";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Kriteria Keuangan SPC ";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC Link (tipe 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Penyedia Dukungan Keamanan NTLM ";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Tanda Waktu Countersignature";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Daftar Kepercayaan Sertifikat";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Ekstensi CTL Pendek";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Lokasi Pembaruan Berikutnya";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Penggunaan Kunci Yang Diperluas ";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Tanda Tangan Daftar Kepercayaan Sertifikat";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Tanda Tangan Tanda Waktu ";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Crypto Berpintu Server";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Enkripsi Berseri";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistem File Encrypted ";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Perbaikan Sistem File Encrypted ";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Kompatibel dengan Windows Hardware";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Tanda  Tangan NT5 ";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Tanda Tangan OEM Windows Hardware ";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Tanda Tangan Embedded NT ";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Persetujuan Daftar Akar Tepercaya";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinasi Diterima";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Pemulihan Kunci";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Tanda Tangan Dokumen";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Pengenal Objek Atribut";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atribut Percaya Ya/Tidak ";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Musik DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualisasi Microsoft DRM ";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Izin Microsoft ";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Server Izin Microsoft ";

"06 08 2B 06 01 04 01 82 37 0D"				= "Pengenal Objek Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Sertifikat Pembaruan";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Pasangan Nama/Nilai Pendaftaran";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Pendaftaran CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versi OS ";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Express";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atribut Microsoft PKCS-12 ";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Set Kunci Mesin Lokal";

"06 08 2B 06 01 04 01 82 37 14"				= "Infrastruktur Pendaftaran Microsoft ";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Penggunaan Auto-Enroll CTL ";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Jenis Sertifikat Pendaftaran";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agen Pendaftaran";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard Logon";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nama Utama NT ";

"06 08 2B 06 01 04 01 82 37 15"				= "Infrastruktur Server Sertifikat Microsoft ";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Versi Pembaruan Microsoft CA ";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versi CAPICOM ";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atribut CAPICOM ";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nama Dokumen";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Deskripsi Dokumen";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Data Encrypted ";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Konten Terenkripsi";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Pengenal Kebijakan UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Pengenal Kebijakan ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Pengenal Kebijakan ICE-TEL CA ";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal dengan SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal dengan RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atribut cryptlib ";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Cek Kehadiran cryptlib ";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS Jawaban OCSP ";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Respons OCSP RTCS Yang Diperluas ";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Alasan Perpanjangan CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Ciri Kunci";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Konten cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Data Konfigurasi cryptlib ";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Indeks Pengguna cryptlib ";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Info Pengguna cryptlib ";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Pengenal Kebijakan XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistem Tanda Tangan Waktu";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistem Tanda Tangan Waktu 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistem Tanda Tangan Waktu 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistem Tanda Tangan Waktu 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Pelaksanaan Sekunder";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Pengenal Dokter";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Data Pengesahan Kerberos ";
"06 07 2B 06 01 05 02 03 02"        = "Data Kunci Kerberos Diffie-Hellman ";
"06 07 2B 06 01 05 02 03 03"        = "Data Kunci Balas Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Pengesahan Klien Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Pusat Distribusi Kunci Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mekanisme Kunci Publik Sederhana (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastruktur Kunci Publik ";

"06 07 2B 06 01 05 05 07 01"		= "Ekstensi Sertifikat Pribadi PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Akses Informasi Otoritas Sertifikat";
"06 08 2B 06 01 05 05 07 01 02"		= "Informasi Biometrik";
"06 08 2B 06 01 05 05 07 01 03"		= "Pernyataan Sertifikat Diterima";
"06 08 2B 06 01 05 05 07 01 04"		= "Identitas Audit Sertifikat Atribut";
"06 08 2B 06 01 05 05 07 01 05"		= "Menargetkan Sertifikat Atribut";
"06 08 2B 06 01 05 05 07 01 06"		= "Kontrol Otoritas Sertifikat Atribut";
"06 08 2B 06 01 05 05 07 01 07"		= "Blok Alamat SBGP IP ";
"06 08 2B 06 01 05 05 07 01 08"		= "Pengenal Sistem Otonomi SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Pengenal SBGP Router ";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxy Sertifikat Atribut";
"06 08 2B 06 01 05 05 07 01 0B"		= "Akses Informasi Subjek";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Jenis Kebijakan Qualifier";
"06 08 2B 06 01 05 05 07 02 01"		= "Pernyataan Pelaksanaan Sertifikat";
"06 08 2B 06 01 05 05 07 02 02"		= "Pemberitahuan Pengguna";
"06 08 2B 06 01 05 05 07 02 03"		= "Pemberitahuan Teks";

"06 07 2B 06 01 05 05 07 03"		= "Tujuan Kunci";
"06 08 2B 06 01 05 05 07 03 01"		= "Pengesahan Server ";
"06 08 2B 06 01 05 05 07 03 02"		= "Pengesahan Klien";
"06 08 2B 06 01 05 05 07 03 03"		= "Tanda Tangan Kode";
"06 08 2B 06 01 05 05 07 03 04"		= "Proteksi Email ";
"06 08 2B 06 01 05 05 07 03 05"		= "Sistem Akhir IPSEC ";
"06 08 2B 06 01 05 05 07 03 06"		= "Terusan IPSEC ";
"06 08 2B 06 01 05 05 07 03 07"		= "Pengguna IPSEC ";
"06 08 2B 06 01 05 05 07 03 08"		= "Stempel Waktu ";
"06 08 2B 06 01 05 05 07 03 09"		= "Tanda Tangan OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Pengesahan Server SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Jenis Informasi CMP ";
"06 08 2B 06 01 05 05 07 04 01"		= "Sertifikat Enkripsi Protokol CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Jenis Pasangan Kunci Penandatanganan";
"06 08 2B 06 01 05 05 07 04 03"		= "Enkripsi Jenis Pasangan Kunci ";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritma Simetrik Pilihan";
"06 08 2B 06 01 05 05 07 04 05"		= "Info Pembaruan Kunci CA ";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL Sekarang";
"06 08 2B 06 01 05 05 07 04 07"		= "OID Tidak Didukung";
"06 08 2B 06 01 05 05 07 04 08"		= "Permintaan Berlangganan";
"06 08 2B 06 01 05 05 07 04 09"		= "Jawaban Berlangganan";
"06 08 2B 06 01 05 05 07 04 0A"		= "Permintaan Parameter Pasangan Kunci";
"06 08 2B 06 01 05 05 07 04 0B"		= "Jawaban Parameter Pasangan Kunci";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registrasi CRMF ";
"06 08 2B 06 01 05 05 07 05 01"		= "Pendaftaran Kontrol";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Pendaftaran Token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Pembuat Pengesahan";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Info Publikasi PKI ";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Pilihan Arsip PKI ";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID Sertifikat Lama";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Kunci Enkripsi Protokol ";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Template Sertifikat Alternatif";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Templat WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Info Registrasi CRMF ";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Pasangan UTF-8 ";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Permohonan Sertifikat";

"06 07 2B 06 01 05 05 07 06"		= "Algoritma";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Tanpa Tanda Tangan ";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Kontrol CMC ";

"06 07 2B 06 01 05 05 07 08"		= "Nama Lain";
"06 08 2B 06 01 05 05 07 08 01"		= "Data Pribadi";
"06 08 2B 06 01 05 05 07 08 02"		= "Grup Pengguna";

"06 07 2B 06 01 05 05 07 09"		= "Data Pribadi";
"06 08 2B 06 01 05 05 07 09 01"		= "Tanggal Lahir";
"06 08 2B 06 01 05 05 07 09 02"		= "Tempat Lahir";
"06 08 2B 06 01 05 05 07 09 03"		= "Alias";
"06 08 2B 06 01 05 05 07 09 04"		= "Jenis Kelamin";
"06 08 2B 06 01 05 05 07 09 05"		= "Kewarganegaraan";
"06 08 2B 06 01 05 05 07 09 06"		= "Negara Tempat Tinggal";

"06 07 2B 06 01 05 05 07 0A"		= "Sertifikat Atribut";
"06 08 2B 06 01 05 05 07 0A 01"		= "Informasi Pengesahan";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identitas Akses";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identitas Memuat";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grup";
"06 08 2B 06 01 05 05 07 0A 05"		= "Peran";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protokol Status Sertifikat Online";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Respons Dasar OCSP ";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Ekstensi OCSP Nonce ";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Referensi OCSP CRL ";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Jawaban OCSP ";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Tanpa Cek Pembatalan OCSP ";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Batas Arsip OCSP ";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Layanan Penentuan Lokasi OCSP ";

"06 08 2B 06 01 05 05 07 30 02"		= "Pembuat CA ";
"06 08 2B 06 01 05 05 07 30 03"		= "Stempel Waktu ";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Menengah";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritma Enkripsi DEC ";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritma Kecil DEC ";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritma Tanda Tangan DEC ";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 dengan RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 dengan RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 dengan RSA";
"06 05 2B 0E 03 02 03"				= "MD5 dengan RSA";
"06 05 2B 0E 03 02 04"				= "MD4 dengan Enkripsi RSA ";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N dengan RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Tanda Tangan RSA ";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA dengan SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 dengan Tanda Tangan RSA ";
"06 05 2B 0E 03 02 0F"				= "SHA dengan Tanda Tangan RSA ";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman dengan Modulus Umum";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Umum";
"06 05 2B 0E 03 02 15"				= "DSA Umum dengan SHA";
"06 05 2B 0E 03 02 16"				= "Transportasi Kunci RSA ";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 dengan Tanda Tangan RSA ";
"06 05 2B 0E 03 02 19"				= "MD5 dengan Tanda Tangan RSA ";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA dengan SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA dengan SHA-1 Umum";
"06 05 2B 0E 03 02 1D"				= "SHA-1 dengan Enkripsi RSA Encryption";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 dengan RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 dengan ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokumen";
"06 04 2B 24 01 01"					= "Versi Akhir";
"06 04 2B 24 01 02"					= "Konsep";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritma";
"06 04 2B 24 03 01"					= "Algoritma Enkripsi ";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Enkripsi RSA ";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Algoritma Bagian ";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Panjang Tunggal MDC2 ";
"06 05 2B 24 03 02 05"				= "Panjang Ganda MDC2 ";
"06 04 2B 24 03 03"					= "Algoritma Tanda Tangan";
"06 05 2B 24 03 03 01"				= "Tanda Tangan RSA ";

"06 06 2B 24 03 03 01 01"			= "Tanda Tangan RSA dengan SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Tanda Tangan RSA dengan SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Tanda Tangan RSA dengan SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Tanda Tangan RSA dengan SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Tanda Tangan RSA dengan SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Tanda Tangan RSA dengan SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Tanda Tangan RSA dengan SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Tanda Tangan RSA dengan SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Tanda Tangan RSA dengan SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Tanda Tangan RSA dengan SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Tanda Tangan RSA dengan SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Tanda Tangan RSA dengan SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Tanda Tangan RSA dengan SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Tanda Tangan RSA dengan SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Tanda Tangan RSA dengan SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Tanda Tangan RSA dengan SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Tanda Tangan RSA dengan SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Tanda Tangan RSA dengan SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Tanda Tangan RSA dengan SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Tanda Tangan RSA dengan SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Tanda Tangan RSA dengan SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Tanda Tangan RSA dengan SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Tanda Tangan RSA dengan SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Tanda Tangan RSA dengan SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Tanda Tangan RSA dengan SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Tanda Tangan RSA dengan SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Tanda Tangan RSA dengan RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Tanda Tangan RSA dengan RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Tanda Tangan RSA dengan RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Tanda Tangan RSA dengan RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Tanda Tangan RSA dengan RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Tanda Tangan RSA dengan RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Tanda Tangan RSA dengan RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Tanda Tangan RSA dengan RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Tanda Tangan RSA dengan RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Tanda Tangan RSA dengan RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Tanda Tangan RSA dengan RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Tanda Tangan RSA dengan RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Tanda Tangan RSA dengan RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Tanda Tangan RSA dengan RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Tanda Tangan RSA dengan RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Tanda Tangan RSA dengan RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Tanda Tangan RSA dengan RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Tanda Tangan RSA dengan RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Tanda Tangan RSA dengan RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Tanda Tangan RSA dengan RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Tanda Tangan RSA dengan RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Tanda Tangan RSA dengan RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Tanda Tangan RSA dengan RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Tanda Tangan RSA dengan RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Tanda Tangan RSA dengan RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Tanda Tangan RSA dengan RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Tanda Tangan RSA dengan RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Tanda Tangan RSA dengan RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Tanda Tangan ECSIE";
"06 06 2B 24 03 03 02 01"			= "Tanda Tangan ECSIE dengan SHA-1";
"06 06 2B 24 03 03 02 02"			= "Tanda Tangan ECSIE dengan RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Tanda Tangan ECSIE dengan MD2";
"06 06 2B 24 03 03 02 04"			= "Tanda Tangan ECSIE dengan MD5";

"06 04 2B 24 03 04"					= "Skema Tanda Tangan";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 dengan MERAH";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 dengan RSA

";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 dengan RND

";

"06 03 2B 24 04"					= "Atribut";
"06 03 2B 24 05"					= "Kebijakan";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API Spesifik-Pembuat";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API Fungsi-Spesifik";
"06 03 2B 24 07"					= "Manajemen Kunci";
"06 04 2B 24 07 01"					= "Persetujuan Kunci";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transfer Kunci";
"06 05 2B 24 07 02 01"				= "ISO9796-2 dengan Enkripsi RSA Encryption";

"06 05 2B 24 08 01 01"				= "Pengenal kebijakan Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Direktori Layanan";

"06 05 2B 24 08 03 01"				= "Tanggal Pembuatan Sertifikat";
"06 05 2B 24 08 03 02"				= "Berwenang";
"06 05 2B 24 08 03 03"				= "Penerimaan";
"06 05 2B 24 08 03 04"				= "Limit Keuangan";
"06 05 2B 24 08 03 05"				= "Deklarasi Mayoritas";
"06 05 2B 24 08 03 06"				= "Nomor Serial Kartu Sirkuit Terintegrasi";
"06 05 2B 24 08 03 07"				= "Referensi Kunci Publik";
"06 05 2B 24 08 03 08"				= "Pembatasan";
"06 05 2B 24 08 03 09"				= "Ambil Lagi Jika Boleh";
"06 05 2B 24 08 03 0A"				= "Sertifikat Yang Diminta";
"06 05 2B 24 08 03 0B"				= "Otoritas Pemberian Nama";
"06 05 2B 24 08 03 0C"				= "Sertifikat Di Directory Sejak";
"06 05 2B 24 08 03 0D"				= "Potongan Sertifikat";

"06 05 2B 24 08 04 01"				= "Data Pribadi";
"06 05 2B 24 08 04 08"				= "Pembatasan";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indikasi SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "Indikasi RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA dengan SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA dengan RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Diperluas";
"06 07 2B 24 08 05 01 02 02"		= "DSA dengan RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Sertifikat";
"06 05 2B 24 08 06 02"				= "Referensi Sertifikat";
"06 05 2B 24 08 06 03"				= "Sertifikat Atribut";
"06 05 2B 24 08 06 04"				= "Referensi Atribut";
"06 05 2B 24 08 06 05"				= "Nama File";
"06 05 2B 24 08 06 06"				= "Waktu Penyimpanan";
"06 05 2B 24 08 06 07"				= "Ukuran File";
"06 05 2B 24 08 06 08"				= "Lokasi";
"06 05 2B 24 08 06 09"				= "Nomor Tanda Tangan ";
"06 05 2B 24 08 06 0A"				= "Pembuatan otomatis";

"06 05 2B 24 08 07 01"				= "Jenis Presentasi Teletrust ";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Biner";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Gambar";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Teks";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEnkode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Ekstensi Sertifikat Thawte";
"06 05 2B 65 01 04 01"				= "Ekstranet Kuat";

/* X.520 */

"06 02 55 04"		= "Jenis Atribut X.520";
"06 03 55 04 00"	= "Kelas Objek";
"06 03 55 04 01"	= "Nama Masuk Alias";
"06 03 55 04 02"	= "Informasi Pengetahuan";
"06 03 55 04 03"	= "Nama Umum";
"06 03 55 04 04"	= "Nama Keluarga";
"06 03 55 04 05"	= "Nomor Seri";
"06 03 55 04 06"	= "Nama Negara";
"06 03 55 04 07"	= "Nama Lokalitas";
"06 04 55 04 07 01"	= "Nama Lokal Kolektif";
"06 03 55 04 08"	= "Nama Negara Bagian atau Provinsi";
"06 04 55 04 08 01"	= "Nama Negara Bagian atau Provinsi Kolektif";
"06 03 55 04 09"	= "Nama Jalan";
"06 04 55 04 09 01"	= "Alamat Jalan Kolektif ";
"06 03 55 04 0A"	= "Nama Organisasi";
"06 04 55 04 0A 01"	= "Nama Organisasi Kolektif";
"06 03 55 04 0B"	= "Nama Unit Organisasi";
"06 04 55 04 0B 01"	= "Nama Unit Organisasi Kolektif";
"06 03 55 04 0C"	= "Judul";
"06 03 55 04 0D"	= "Deskripsi";
"06 03 55 04 0E"	= "Petunjuk Pencarian";
"06 03 55 04 0F"	= "Kategori Bisnis";
"06 03 55 04 10"	= "Alamat Pos";
"06 04 55 04 10 01"	= "Alamat Pos Kolektif ";
"06 03 55 04 11"	= "Kode Pos";
"06 04 55 04 11 01"	= "Kode Pos Kolektif ";
"06 03 55 04 12"	= "Kotak Kantor Pos";
"06 04 55 04 12 01"	= "Kotak Kantor Pos Kolektif";
"06 03 55 04 13"	= "Nama Kantor Pengiriman Fisik";
"06 04 55 04 13 01"	= "Nama Kantor Pengiriman Fisik Kolektif";
"06 03 55 04 14"	= "Nomor Telepon";
"06 04 55 04 14 01"	= "Nomor Telepon Kolektif";
"06 03 55 04 15"	= "Nomor Teleks";
"06 04 55 04 15 01"	= "Nomor Teleks Kolektif";
"06 03 55 04 16"	= "Pengenal Terminal Teleteks ";
"06 04 55 04 16 01"	= "Pengenal Terminal Teleteks Kolektif";
"06 03 55 04 17"	= "Nomor Telepon Faksimili";
"06 04 55 04 17 01"	= "Nomor Telepon Fax Kolektif";
"06 03 55 04 18"	= "Alamat X.121 ";
"06 03 55 04 19"	= "Nomor ISDN Internasional";
"06 04 55 04 19 01"	= "Nomor ISDN Internasional Kolektif";
"06 03 55 04 1A"	= "Alamat Terdaftar";
"06 03 55 04 1B"	= "Indikator Tujuan";
"06 03 55 04 1C"	= "Metode Pengiriman Pilihan";
"06 03 55 04 1D"	= "Alamat Presentasi";
"06 03 55 04 1E"	= "Konteks Aplikasi Terdukung";
"06 03 55 04 1F"	= "Anggota";
"06 03 55 04 20"	= "Pemilik";
"06 03 55 04 21"	= "Peran Penghuni";
"06 03 55 04 22"	= "Lihat Juga";
"06 03 55 04 23"	= "Kata Sandi Pengguna";
"06 03 55 04 24"	= "Sertifikat Pengguna";
"06 03 55 04 25"	= "Sertifikat CA";
"06 03 55 04 26"	= "Daftar Pembatalan Otoritas";
"06 03 55 04 27"	= "Daftar Pembatalan Sertifikat";
"06 03 55 04 28"	= "Pasangan Sertifikat Silang";
"06 03 55 04 29"	= "Nama";
"06 03 55 04 2A"	= "Nama Awal";
"06 03 55 04 2B"	= "Parap";
"06 03 55 04 2C"	= "Prasyarat Pembuatan";
"06 03 55 04 2D"	= "Pengenal Unik";
"06 03 55 04 2E"	= "DN Qualifier";
"06 03 55 04 2F"	= "Petunjuk Pencarian Lanjutan";
"06 03 55 04 30"	= "Informasi Protokol";
"06 03 55 04 31"	= "Nama Terhormat";
"06 03 55 04 32"	= "Anggota Unik";
"06 03 55 04 33"	= "Pengenal Rumah";
"06 03 55 04 34"	= "Algoritma Terdukung";
"06 03 55 04 35"	= "Daftar Pembatalan Delta";
"06 03 55 04 36"	= "Pembersihan";
"06 03 55 04 3A"	= "Pasangan Sertifikat Silang";

/* X.500 object classes */

"06 02 55 06"		= "Kelas Objek X.520";
"06 03 55 06 00"	= "Atas";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Negara";
"06 03 55 06 03"	= "Lokalitas";
"06 03 55 06 04"	= "Organisasi";
"06 03 55 06 05"	= "Unit Organisasi";
"06 03 55 06 06"	= "Orang";
"06 03 55 06 07"	= "Orang Organisasi";
"06 03 55 06 08"	= "Peran Organisasi";
"06 03 55 06 09"	= "Nama Grup";
"06 03 55 06 0A"	= "Orang Residensial";
"06 03 55 06 0B"	= "Proses Aplikasi";
"06 03 55 06 0C"	= "Kesatuan Aplikasi";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Perangkat";
"06 03 55 06 0F"	= "Pengguna Pengesahan Kuat";
"06 03 55 06 10"	= "Otoritas Sertifikat";
"06 03 55 06 11"	= "Grup Nama Unik";
"06 03 55 06 15"	= "Pengguna PKI ";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritma X.500";
"06 03 55 08 01"	= "Algoritma Enkripsi X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Ekstensi Sertifikat X.509";
"06 03 55 1D 01"	= "Pengenal Kunci Otoritas (lama)";
"06 03 55 1D 02"	= "Atribut Kunci Utama (lama)";
"06 03 55 1D 03"	= "Kebijakan Sertifikat (lama)";
"06 03 55 1D 04"	= "Pembatasan Penggunaan Kunci (lama)";
"06 03 55 1D 05"	= "Pemetaan Kebijakan (lama)";
"06 03 55 1D 06"	= "Batasan Sub Pohon";
"06 03 55 1D 07"	= "Nama Alternatif Subjek (lama)";
"06 03 55 1D 08"	= "Nama Alternatif Pembuat (lama)";
"06 03 55 1D 09"	= "Atribut Direktori Subjek";
"06 03 55 1D 0A"	= "Batasan Dasar (lama 2.5.29.10)";
"06 03 55 1D 0B"	= "Nama Batasan (lama)";
"06 03 55 1D 0C"	= "Batasan Kebijakan (lama)";
"06 03 55 1D 0D"	= "Batasan Dasar (lama 2.5.29.13)";
"06 03 55 1D 0E"	= "Pengenal Kunci Subjek";
"06 03 55 1D 0F"	= "Penggunaan Kunci";
"06 03 55 1D 10"	= "Waktu Pakai Kunci Pribadi";
"06 03 55 1D 11"	= "Nama Alternatif Subjek";
"06 03 55 1D 12"	= "Nama Alternatif Pembuat";
"06 03 55 1D 13"	= "Batasan Dasar";
"06 03 55 1D 14"	= "Daftar Nomor Pembatalan Sertifikat";
"06 03 55 1D 15"	= "Kode Alasan CRL ";
"06 03 55 1D 16"	= "Tanggal Kedaluwarsa (lama)";
"06 03 55 1D 17"	= "Kode Tunda Perintah";
"06 03 55 1D 18"	= "Tanggal Tidak Sah";
"06 03 55 1D 19"	= "Titik Distribusi CRL (lama)";
"06 03 55 1D 1A"	= "Membuat Titik Distribusi (lama)";
"06 03 55 1D 1B"	= "Indikator Delta CRL ";
"06 03 55 1D 1C"	= "Membuat Titik Distribusi";
"06 03 55 1D 1D"	= "Pembuat Sertifikat";
"06 03 55 1D 1E"	= "Nama Batasan";
"06 03 55 1D 1F"	= "Titik Distribusi CRL ";
"06 03 55 1D 20"	= "Kebijakan Sertifikat";
"06 04 55 1D 20 00"	= "Pengenal Kebijakan Apapun";
"06 03 55 1D 21"	= "Pemetaan Kebijakan ";
"06 03 55 1D 22"	= "Batasan Kebijakan";
"06 03 55 1D 23"	= "Pengenal Kunci Otoritas";
"06 03 55 1D 24"	= "Batasan Kebijakan";
"06 03 55 1D 25"	= "Penggunaan Kunci Yang Diperluas ";
"06 04 55 1D 25 00"	= "Penggunaan Kunci Yang Diperluas Apapun";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritma Tanda Tangan SDNS ";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritma Tanda Tangan Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritma Konfidensial SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritma Konfidensial Fortezza ";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritma Integritas SDNS ";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritma Integritas Fortezza ";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritma Perlindungan Token SDNS ";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritma Perlindungan Token Fortezza ";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritma Manajemen Kunci SDNS ";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritma Manajemen Kunci Fortezza ";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritma Tanda Tangan dan Manajemen Kunci SDNS ";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritma Tanda Tangan dan Manajemen Kunci Fortezza ";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritma Tanda Tangan Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritma Konfidensial Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritma Integritas Suite A ";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritma Perlindungan Token Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritma Manajemen Kunci Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritma Tanda Tangan dan Manajemen Kunci Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritma Persetujuan Fortezza Terbaru";
"06 09 60 86 48 01 65 02 01 01 14"	= "Manajemen Kunci Fortezza dan Algoritma Persetujuan Terbaru";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritma Integritas Fortezza Terbaru";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritma Kunci Exchange";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritma Fortezza Wrap80 ";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritma Enkripsi Kunci (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Format Pesan RFC 822 ";
"06 09 60 86 48 01 65 02 01 02 02"	= "Konten Kosong";
"06 09 60 86 48 01 65 02 01 02 03"	= "Jenis Konten CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Jenis Konten MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Jenis Konten MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protokol Agen Kunci Ulang MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Jenis Konten MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Isi Pesan MSP Yang Diteruskan";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parameter Pesan Yang Diteruskan MSP ";
"06 09 60 86 48 01 65 02 01 02 50"	= "Isi Pesan CSP Yang Diforward";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parameter Pesan Yang Diteruskan CSP ";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Kebijakan Keamanan SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaik PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Kebijakan Keamanan";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Generik";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Kebijakan Keamanan Default ";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Sertifikat Manajemen Kunci SDNS ";
"06 09 60 86 48 01 65 02 01 05 02"	= "Sertifikat Tanda Tangan Pengguna SDNS  ";
"06 09 60 86 48 01 65 02 01 05 03"	= "Sertifikat Tanda Tangan dan Manajemen Kunci SDNS ";
"06 09 60 86 48 01 65 02 01 05 04"	= "Sertifikat Manajemen Kunci Fortezza ";
"06 09 60 86 48 01 65 02 01 05 05"	= "Sertifikat Tanda Tangan dan Manajemen Kunci Fortezza ";
"06 09 60 86 48 01 65 02 01 05 06"	= "Sertifikat Tanda Tangan Pengguna Fortezza ";
"06 09 60 86 48 01 65 02 01 05 07"	= "Sertifikat Tanda Tangan Fortezza CA ";
"06 09 60 86 48 01 65 02 01 05 08"	= "Sertifikat Tanda Tangan SDNS CA ";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vektor Tambahan";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Kebijakan Laporan";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Keanggotaan";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Operator";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Tanda Tangan CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS Tanda Tangan CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Daftar Pembatalan Sertifikat SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Daftar Pembatalan Sertifikat Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Alamat Prosesor Yang Dikecualikan";
"06 09 60 86 48 01 65 02 01 05 30"	= "Pelindung";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritma Didukung";
"06 09 60 86 48 01 65 02 01 05 32"	= "Sertifikat Manajemen Kunci Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Sertifikat Tanda Tangan dan Manajemen Kunci Suite A ";
"06 09 60 86 48 01 65 02 01 05 34"	= "Sertifikat Tanda Tangan Pengguna Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Info PRBAC ";
"06 09 60 86 48 01 65 02 01 05 36"	= "Batasan PRBAC CA ";
"06 09 60 86 48 01 65 02 01 05 37"	= "Hak Manajemen Kunci atau Tanda Tangan";
"06 09 60 86 48 01 65 02 01 05 38"	= "Hak Komunitas";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribut Berlabel";
"06 09 60 86 48 01 65 02 01 05 3A"	= "File Informasi Kebijakan";
"06 09 60 86 48 01 65 02 01 05 3B"	= "File Informasi Bagian Kebijakan ";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Batasan Izin CA ";

"06 09 60 86 48 01 65 02 01 07 01"		= "Ekstensi CSP ";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Kategori Keamanan ISSI ";
"06 09 60 86 48 01 65 02 01 08 02"		= "Hak Label Keamanan Standar";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Hak Tanda Tangan";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Hak Manajemen Kunci";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Hak Atur Label Yang Dinamai";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Departemen Pertahanan AS Kelas 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "Pilot Menengah AS";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Departemen Pertahanan AS Kelas 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Departemen Pertahanan AS Kelas 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Departemen Pertahanan AS Kelas 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Departemen Pertahanan AS PKI Kelas 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Tes Kebijakan Keamanan";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Label Set Nol";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Label Set Satu";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Label Set Dua";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Kategori Keamanan TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Label Set Nol";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Label Set Satu";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Label Set Dua";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kategori Keamanan Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nama Set Label Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nama Set Label Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nama Set Label Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Tes Masuk CRL ";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Label";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Pengenal Kebijakan GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Pengenal Kebijakan FBCA Awal";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Pengenal Kebijakan FBCA Dasar";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Pengenal Kebijakan FBCA Menengah";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Pengenal Kebijakan FBCA Tinggi";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Kunci KRA ";
"06 08 60 86 48 01 65 03 02 03"			= "Ekstensi ";
"06 09 60 86 48 01 65 03 02 03 01"		= "Teknik Pemulihan Kunci";
"06 09 60 86 48 01 65 03 02 03 02"		= "Kemampuan Pemulihan Kunci";
"06 09 60 86 48 01 65 03 02 03 03"		= "Pemulihan Kunci";
"06 08 60 86 48 01 65 03 02 04"			= "Skema Pemulihan Kunci";
"06 08 60 86 48 01 65 03 02 05"			= "Ekstensi CSOR GAK ";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritma NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritma Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 dengan Enkripsi RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 dengan Enkripsi RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 dengan Enkripsi RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC dengan SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC dengan MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Paket MD4 ";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Enkripsi RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Kata Sandi NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Jenis Atribut PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Aplikasi Atribut";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Batas Kepercayaan";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Pengenal Objek Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Ekstensi Sertifikat Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Jenis Sertifikat Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL Berbasis Netscape ";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL Pembatalan Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA Pembatalan URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL Download Netscape CRL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA Sertifikat Download URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape Sertifikat Pembaruan URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA Kebijakan URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL Sertifikat Layar Utama Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo Entitas Sertifikat Netscape ";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Foto Pengguna Sertifikat Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nama Netscape SSL Server ";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape Komentar Sertifikat";

"06 08 60 86 48 01 86 F8 42 02"		= "Jenis Data Netscape ";
"06 09 60 86 48 01 86 F8 42 02 01"	= "Gambar/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "gambar/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "teks/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape Susunan Sertifikat";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL Sertifikat Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Pengenal Objek Direktori Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definisi LDAP ";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Izin Mobil";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Nomor Departemen";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Nomor Pegawai";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Jenis Pekerja";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Orang Organisasi Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Crypto Berpintu Server";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Ekstensi Verisign VPN Tidak Dikenali";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Ekstensi Verisign VPN Tidak Dikenali";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Pengenal Kebijakan Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Pemberitahuan Verisign CPS v1 ";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "NSI Verisign CPS v1 ";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Jenis Konten";
"06 04 67 2A 00 00"	= "Data PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "PAN Saja ";

"06 03 67 2A 01"	= "Pesan Ekstensi";
"06 03 67 2A 02"	= "Bidang";
"06 04 67 2A 02 00"	= "Nama Lengkap";
"06 04 67 2A 02 01"	= "Nama Awal";
"06 04 67 2A 02 02"	= "Nama Keluarga";
"06 04 67 2A 02 03"	= "Nama Lahir Keluarga";
"06 04 67 2A 02 04"	= "Nama Tempat";
"06 04 67 2A 02 05"	= "Nomor Identifikasi";
"06 04 67 2A 02 06"	= "Bulan";
"06 04 67 2A 02 07"	= "Tanggal";
"06 04 67 2A 02 08"	= "Alamat";
"06 04 67 2A 02 09"	= "Telepon";
"06 04 67 2A 02 0A"	= "Jumlah";
"06 04 67 2A 02 0B"	= "Nomor Akun";
"06 04 67 2A 02 0C"	= "Passphrase";

"06 03 67 2A 03"		= "Atribut";
"06 04 67 2A 03 00"		= "Sertifikat";
"06 05 67 2A 03 00 00"	= "Sidik Jari Kunci Akar";
"06 05 67 2A 03 00 01"	= "Kebijakan Tambahan";

"06 03 67 2A 04"	= "Algoritma";
"06 03 67 2A 05"	= "Kebijakan";
"06 04 67 2A 05 00"	= "Akar";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Ekstensi Sertifikat";
"06 04 67 2A 07 00"	= "Kunci Akar Kecil";
"06 04 67 2A 07 01"	= "Jenis Sertifikat";
"06 04 67 2A 07 02"	= "Data Pedagang";
"06 04 67 2A 07 03"	= "Sertifikat Kartu Diperlukan";
"06 04 67 2A 07 04"	= "Terobosan";
"06 04 67 2A 07 05"	= "Ekstensi SET";
"06 04 67 2A 07 06"	= "Syarat SET";

"06 03 67 2A 08"	= "Merek";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Tamu ";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Penjual";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Mempercayakan";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Pedagang dalam";
"06 04 67 2A 09 1D"	= "Kesemek";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nasional";
"06 05 67 2A 0A E2 00"	= "Jepang";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Kunci Akar Kecil";
"06 04 86 8D 6F 03"	= "Jenis Sertifikat";
"06 04 86 8D 6F 04"	= "Data Pedagang";
"06 04 86 8D 6F 05"	= "Sertifikat Kartu Diperlukan";
"06 04 86 8D 6F 06"	= "Terobosan";
"06 04 86 8D 6F 07"	= "Syarat SET";
"06 04 86 8D 6F 63"	= "SET Data";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Keamanan Data Apple ";

"06 08 2A 86 48 86 F7 63 64 01" = "Pengenal Kebijakan Kepercayaan Apple ";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Kebijakan Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Kebijakan Dasar Apple X.509 ";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Kebijakan SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Kebijakan Pembuatan Sertifikat Lokal Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Kebijakan Pembuatan CSR Lokal Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Kebijakan Pembatalan CRL Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Kebijakan Pembatalan OCSP Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Kebijakan S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Kebijakan Apple Tentang Pengesahan Yang Dapat Diperluas";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Kebijakan Persetujuan Pembaruan Perangkat Lunak Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Kebijakan Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Kebijakan Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Kebijakan Tanda Tangan Sumber Daya Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Kebijakan Klien Apple Kerberos ";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Kebijakan Server Apple Kerberos ";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Kebijakan Tanda Tangan Kode Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Kebijakan Tanda Tangan Paket Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Pengenal Algoritma Keamanan Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Enkripsi Eliptik Kilat (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Kompresi Aman Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE dengan Tanda Tangan MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE dengan Tanda Tangan SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Enkripsi Apple FEED ";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Eksperimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE dengan Tanda Tangan ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac Pengenal Sertifikat";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac Permohonan Sertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac Permohonan Sertifikat Identitas";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac Permohonan Sertifikat Tanda Tangan Email ";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac Permohonan Sertifikat Enkripsi Email ";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac Permintaan Daftar Arsip";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac Permintaan Arsip Store";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac Mengarsip Permintaan Fetch";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac Permintaan Hapus Arsip";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac Ekstensi Sertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac Identitas";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac Tanda Tangan Email ";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac Enkripsi Email ";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac Nilai Permohonan Sertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nama Pengguna";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Kata Sandi";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nama Host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Perbarui Bendera";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Bendera Asynchronous ";

"06 08 2A 86 48 86 F7 63 64 04" = "Penggunaan Kunci Yang Diperluas Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Tanda Tangan Kode Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Tanda Tangan Kode Apple (Pengembangan)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Persetujuan Pembaruan Perangkat Lunak Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Tanda Tangan Kode Apple (Dilindungi)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Tanda Tangan Sumber Daya Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Tanda Tangan Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Enkripsi Apple iChat ";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identitas Sistem Apple ";

"06 08 2A 86 48 86 F7 63 64 05" = "Kebijakan Sertifikat Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Kebijakan Sertifikat Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac Kebijakan Sertifikat";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Tanda Tangan Kode";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Keamanan Intel CDSA ";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Format Keamanan Intel CDSA ";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Ekstensi Sertifikat X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Ekstensi Sertifikat Pribadi X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Tanda Tangan Bitmap Subjek";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Gambar Subjek";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Alamat Email Subjek";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Pengecualian Penggunaan";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritma Keamanan Intel CDSA ";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 dengan ECDSA";

/* end */
